ReadingChangedNotification_1.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<soap:Header>
		<MultiSpeakMsgHeader xmlns="http://www.multispeak.org/Version_3.0" UserID="" Pwd="" AppName="" AppVersion="0.1" Company=""/>
	</soap:Header>
	<soap:Body>
		<ReadingChangedNotification xmlns="http://www.multispeak.org/Version_3.0">
			<changedMeterReads>
				<meterRead objectID="19405">
					<meterNo>4155739</meterNo>
					<deviceID>4155739</deviceID>
					<readingDate>2014-02-11T10:47:32-06:00</readingDate>
					<posKWh>8776</posKWh>
				</meterRead>
			</changedMeterReads>
			<transactionID>1392137232143</transactionID>
		</ReadingChangedNotification>
	</soap:Body>
</soap:Envelope>
